Revit 2024 API
BendingDetailCustomFieldProperties Class
 Represents the properties of a Bending Detail Custom Field.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public class BendingDetailCustomFieldProperties : ICustomFieldProperties,
	IDisposable
Visual Basic
Public Class BendingDetailCustomFieldProperties _
	Implements ICustomFieldProperties, IDisposable
Visual C++
public ref class BendingDetailCustomFieldProperties : ICustomFieldProperties,
	IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties
See Also
BendingDetailCustomFieldProperties Members
Autodesk.Revit.DB.Structure Namespace